// Дано число больше 9. Вывести на экран  вторую цифру числа с конца
int a =862;
int b = (a/10)%10;
Console.Write(b);
