// Вывести на экран четные числа от 1 до N
int i = 0;
int N = 10;
while (i<=N)
{
    System.Console.Write($"{i} ");
    i=i+2;
}